app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)
    if @account.save
---
INSERT INTO "accounts" ("created_at", "email", "encrypted_password", "owner_id", "updated_at") VALUES (?, ?, ?, ?, ?)