app/controllers/cars_controller.rb

INSERT INTO "cars" ("created_at", "model", "owner_id", "registration_number", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-03 10:16:22.904440"], ["model", "new"], ["owner_id", 222665832], ["registration_number", "23 78543"], ["updated_at", "2014-06-03 10:16:22.904440"]]
---
  def create
    @car = current_user.cars.build(car_params)
    if @car.save

SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = ? LIMIT 1  [["id", 785323387]]
---
  def edit
    @car = Car.find(params[:permalink])

SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = ? LIMIT 1  [["id", 785323387]]
UPDATE "cars" SET "model" = ?, "updated_at" = ? WHERE "cars"."id" = 785323387  [["model", "model updated"], ["updated_at", "2014-06-03 10:24:17.534222"]]
---
  def update
    @car = Car.find(params[:permalink])
    if @car.update(car_params)

SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = ? LIMIT 1  [["id", 785323388]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 785323388]]
---
  def destroy
    @car = Car.find(params[:permalink])
    @car.destroy