app/controllers/parkings_controller.rb

SELECT "parkings".* FROM "parkings"  WHERE (day_price BETWEEN 9 AND 11)
---
  def index
    @parkings = Parking.search(params)

SELECT  "parkings".* FROM "parkings"  WHERE "parkings"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @parking = Parking.find(params[:id])

INSERT INTO "parkings" ("address_id", "day_price", "hour_price", "kind", "owner_id", "places") VALUES (?, ?, ?, ?, ?, ?)  [["address_id", 1009469987], ["day_price", 10.0], ["hour_price", 1.0], ["kind", "private"], ["owner_id", 962534081], ["places", 1]]
---
  def create
    @owner = current_user
    @parking = @owner.parkings.create(parking_params)

SELECT  "parkings".* FROM "parkings"  WHERE "parkings"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @parking = Parking.find(params[:id])

SELECT  "parkings".* FROM "parkings"  WHERE "parkings"."id" = ? LIMIT 1  [["id", 298486374]]
UPDATE "parkings" SET "address_id" = ?, "day_price" = ?, "hour_price" = ?, "kind" = ?, "places" = ? WHERE "parkings"."id" = 298486374  [["address_id", 1009469989], ["day_price", 101.0], ["hour_price", 11.0], ["kind", "street"], ["places", 31]]
---
  def update
    @parking = Parking.find(params[:id])
    if @parking.update(parking_params)

SELECT  "parkings".* FROM "parkings"  WHERE "parkings"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "parkings" WHERE "parkings"."id" = ?  [["id", 2]]
---
  def destroy
    @parking = Parking.find(params[:id])
    @parking.destroy