app/controllers/place_rents_controller.rb

SELECT "place_rents".* FROM "place_rents"
---
  def index
    @place_rents = PlaceRent.all

SELECT  "place_rents".* FROM "place_rents"  WHERE "place_rents"."identifier" = 264136284 LIMIT 1
---
  def show
    @place_rent = PlaceRent.find_by! identifier: params[:identifier]

SELECT  "parkings".* FROM "parkings"  WHERE "parkings"."id" = ? LIMIT 1  [["id", 4]]
---
  def new
    @parking = Parking.find(params[:parking_id])

SELECT  "parkings".* FROM "parkings"  WHERE "parkings"."id" = ? LIMIT 1  [["id", 298486374]]
INSERT INTO "place_rents" ("car_id", "created_at", "end_date", "identifier", "parking_id", "price", "start_date", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @parking = Parking.find(params[:parking_id])
    @place_rent = @parking.place_rents.create(place_rent_params)

SELECT  "place_rents".* FROM "place_rents"  WHERE "place_rents"."identifier" = 448025364 LIMIT 1
DELETE FROM "place_rents" WHERE "place_rents"."id" = ?  [["id", 980190962]]
---
  def destroy
    @place_rent = PlaceRent.find_by! identifier: params[:identifier]
    @place_rent.destroy